print("-----------------------------------------------")
print("                  Здравствуйте!               ")
print("            это игра Крестики-Нолики          ")
print("-----------------------------------------------")
print("                    ПРАВИЛА:                  ")
print(" Игроки по очереди ставят на свободные клетки "
      "\n   поля 3×3 знаки (один всегда крестики, "
      "\n          другой всегда нолики). "
      "\n Выигрывает игрок, выстроивший в ряд 3 своих"
      "\nфигуры по вертикали, горизонтали или диагонали."
      "\n  Первый ход делает игрок, ставящий крестики. ")
print("-----------------------------------------------")
print(" формат ввода: x y ")
print(" x - номер строки  ")
print(" y - номер столбца ")
print("-----------------------------------------------")

def choice():
    while True:
        choices = input('Введитете "да" или "нет": ')
        if choices == 'да':
            return True
        elif choices == 'нет':
            return False
        else:
            print("-----------------------------------------------")
            print("Неверный ввод")
            continue

def game_field():
    print("     Игровое поле   ")
    print("    | 0 | 1 | 2 | ")
    print("  --------------- ")
    for i, row in enumerate(field):
        row_str = f"  {i} | {' | '.join(row)} | "
        print(row_str)
        print("  --------------- ")

def move():
    while True:
        cords = input("Введите номер строки и номер столбца \nчерез пробел: ").split()
        
        if len(cords) != 2:
            print("-----------------------------------------------")
            print(" Введите 2 числа через пробел! ")
            print("-----------------------------------------------")
            continue
        
        x, y = cords
        
        if not(x.isdigit()) or not(y.isdigit()):
            print("-----------------------------------------------")
            print(" Введите числа! ")
            print("-----------------------------------------------")
            continue
        
        x, y = int(x), int(y)
        
        if 0 > x or x > 2 or  0 > y or  y > 2 :
            print("-----------------------------------------------")
            print(" Введите числа от 0 до 2! ")
            print("-----------------------------------------------")
            continue
        
        if field[x][y] != " ":
            print("-----------------------------------------------")
            print(" Клетка занята! ")
            print("-----------------------------------------------")
            continue
        
        return x, y
            
def winner():
    win_cord = (((0, 0), (0, 1), (0, 2)), ((1, 0), (1, 1), (1, 2)), ((2, 0), (2, 1), (2, 2)),
                ((0, 2), (1, 1), (2, 0)), ((0, 0), (1, 1), (2, 2)), ((0, 0), (1, 0), (2, 0)),
                ((0, 1), (1, 1), (2, 1)), ((0, 2), (1, 2), (2, 2)))
    for cord in win_cord:
        symbols = []
        for c in cord:
            symbols.append(field[c[0]][c[1]])
        if symbols == ["X", "X", "X"]:
            game_field()
            print("-----------------------------------------------")
            print(f"    Выиграл(-а) {player_x}!!! Поздравляем!     ")
            print("-----------------------------------------------")
            return True
        if symbols == ["0", "0", "0"]:
            game_field()
            print("-----------------------------------------------")
            print(f"    Выиграл(-а) {player_0}!!! Поздравляем!     ")
            print("-----------------------------------------------")
            return True
    return False


print("               Вы готовы сыграть?               ")
ch = choice()

while ch is True:
    print("-----------------------------------------------")
    print("               Отлично! Начнем!                ")
    print("-----------------------------------------------")
    player_x = input("Введите имя игрока, который будет играть \nкрестиками: ")
    print("-----------------------------------------------")
    player_0 = input("Введите имя игрока, который будет играть \nноликами: ")
    print("-----------------------------------------------")
    print(f"    Привет, {player_x} и {player_0}! Играем!    ")
    print("-----------------------------------------------")

    field = [[" "] * 3 for i in range(3)]
    count = 0
    while True:
        count += 1
        game_field()
        if count % 2 == 1:
            print(f"Ходит {player_x}!")
            print("-----------------------------------------------")
        else:
            print(f"Ходит {player_0}!")
            print("-----------------------------------------------")

        x, y = move()

        if count % 2 == 1:
            field[x][y] = 'X'
        else:
            field[x][y] = '0'

        if winner():
            print("Сыграем еще раз?")
            ch = choice()
            break

        if count == 9:
            game_field()
            print("-----------------------------------------------")
            print("                    Ничья!                     ")
            print("-----------------------------------------------")
            print("Сыграем еще раз?")
            ch = choice()
            break


print("-----------------------------------------------")
print("                  Конец игры!                  ")
print("-----------------------------------------------")



